In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df["first"] + " " + df["last"]

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [7]:
df["full_name"] = df["first"] + " " + df["last"]

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [9]:
df.drop(columns = ["first","last"], inplace=True)

In [10]:
df["full_name"].str.split(" ", expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [11]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand = True)

In [12]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [13]:
df.append({"first":"Tony"},ignore_index=True)

C:\Users\subhp\AppData\Local\Temp\ipykernel_12232\3818590352.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"first":"Tony"},ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [14]:
people = {
    'first': ['Tony', 'Steve', ], 
    'last': ['Stark', 'Rogers', ], 
    'email': ['ironman@avenge.com', 'cap@avenge.com', ]
}

df2 = pd.DataFrame(people)

In [15]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [16]:
df.append(df2, ignore_index=True)

C:\Users\subhp\AppData\Local\Temp\ipykernel_12232\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       ironman@avenge.com            NaN   Tony    Stark
4           cap@avenge.com            NaN  Steve   Rogers

In [17]:
df2["full_name"] = df2["first"] + " " + df2["last"]

In [18]:
df2

   first    last               email     full_name
0   Tony   Stark  ironman@avenge.com    Tony Stark
1  Steve  Rogers      cap@avenge.com  Steve Rogers

In [20]:
df.sort_values(by="last")

                     email      full_name  first     last
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer

In [22]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [31]:
df.sort_values(by=["last","first"])

   first     last      full_name                    email
1   Jane      Doe       Jane Doe        JaneDoe@email.com
2   John      Doe       John Doe        JohnDoe@email.com
0  Corey  Schafer  Corey Schafer  CoreyMSchafer@gmail.com

In [30]:
df.sort_index()

   first     last      full_name                    email
0  Corey  Schafer  Corey Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe        JaneDoe@email.com
2   John      Doe       John Doe        JohnDoe@email.com

In [25]:
df.columns

Index(['email', 'full_name', 'first', 'last'], dtype='object')

In [26]:
df = df[['first', 'last', 'full_name', 'email']]

In [27]:
df

   first     last      full_name                    email
0  Corey  Schafer  Corey Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe       Jane Doe        JaneDoe@email.com
2   John      Doe       John Doe        JohnDoe@email.com